app/controllers/restaurant_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Chicken shop"], ["description", "Great"], ["created_at", 2016-10-05 10:48:21 UTC], ["updated_at", 2016-10-05 10:48:21 UTC], ["user_id", 1]]
---
   def create
     @user = User.find(current_user.id)
     @restaurant = @user.restaurants.create(restaurant_params)