app/controllers/review_controller.rb

INSERT INTO "reviews" ("score", "comment", "created_at", "updated_at", "restaurant_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 5], ["comment", "very chickeny"], ["created_at", 2016-10-05 11:14:11 UTC], ["updated_at", 2016-10-05 11:14:11 UTC], ["restaurant_id", 7], ["user_id", 6]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.create(score: 2, comment: "good")