app/controllers/review_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    if user_signed_in?
      @user = User.find(current_user.id)
      @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @restaurant = Restaurant.find(params[:restaurant_id])